Revit 2027 API
IFCPropertyMappingInfo.IFCPropertyName Property
 The IFC property name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string IFCPropertyName { get; set; }
Public Property IFCPropertyName As String
	Get
	Set
public:
property String^ IFCPropertyName {
	String^ get ();
	void set (String^ value);
}
member IFCPropertyName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
IFCPropertyMappingInfo Class
Autodesk.Revit.DB Namespace